# GetDefaultResolutionCaption Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage..::..GetDefaultResolutionCaption Method
FailureMessage Class See Also
---
Retrieves the caption of the default resolution of the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string GetDefaultResolutionCaption()
```

Visual Basic
---
```text
Public Function GetDefaultResolutionCaption As String
```

Visual C++
---
```text
public:
String^ GetDefaultResolutionCaption()
```

# ### Return Value
The caption of the default resolution of the failure.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailureMessage does not have any resolutions. |

# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace